config.org
#+TITLE: Doom Emacs Configuration
#+AUTHOR: Ahsanur Rahman 
#+STARTUP: overview
#+PROPERTY: :lexical yes

* Initial Setup
** Lexical binding
#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src

** User Information
#+begin_src emacs-lisp
(setq user-full-name "Ahsanur Rahman"
      user-mail-address "ahsanur041@proton.me")
#+end_src

** General Emacs Behaviour

#+begin_src emacs-lisp
;; Prefer y-or-n over yes-or-no
(defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

* UI and Theming
** Theming
#+begin_src emacs-lisp
(setq doom-theme 'catppuccin)
#+end_src

** Fonts
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 14.5 :weight 'medium)
      doom-variable-pitch-font (font-spec :family "JetBrainsMono Nerd Font" :size 14.5)
      doom-big-font (font-spec :family "JetBrainsMono Nerd Font" :size 26.0))
(setq doom-unicode-font (font-spec :family "JetBrainsMono Nerd Font" :size 14.5))

(add-hook! 'doom-after-init-hook
  (defun +my/setup-font-faces ()
    "Configure font faces after Doom initialization."
    (set-face-attribute 'font-lock-comment-face nil :slant 'italic)
    (set-face-attribute 'font-lock-keyword-face nil :slant 'italic)))
#+end_src

** Lines
#+begin_src emacs-lisp
;; Line Spacing
(setq-default line-spacing 0.002)

;; Line Numbers
(add-hook! '(org-mode-hook term-mode-hook shell-mode-hook eshell-mode-hook)
           #'(lambda () (display-line-numbers-mode -1)))
#+end_src

** Dashboard
#+begin_src emacs-lisp
(setq +doom-dashboard-banner-padding '(0 . 2))
(setq +doom-dashboard-banner-file "~/.config/doom/banner.png")
;;(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
;; (remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-footer)
#+end_src

** Which Key
#+begin_src emacs-lisp
(after! which-key
  (setq which-key-popup-type 'minibuffer))
#+end_src

** Modeline
#+begin_src emacs-lisp
(after! doom-modeline
  (setq doom-modeline-buffer-file-name-style 'truncate-upto-project
        doom-modeline-display-buffer-encoding nil
        doom-modeline-display-buffer-encoding nil))
#+end_src

** Rainbow Delimiters
#+begin_src emacs-lisp
(use-package! rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

* Editor & Evil
** Core

#+begin_src emacs-lisp
(setq evil-split-window-below t
      evil-vsplit-window-right t
      evil-want-fine-undo t)
#+end_src

** TODO Custom cursor colors from vanilla config
Change to catppuccin mocha theme
#+begin_src emacs-lisp
(setq evil-normal-state-cursor '(box "#fab387")  ;; Catppuccin Mocha Peach
      evil-insert-state-cursor '(bar "#f38ba8")  ;; Catppuccin Mocha Red
      evil-visual-state-cursor '(hollow "#fab387")) ;; Catppuccin Mocha Peach
#+end_src

** Use jk to escape insert mode

#+begin_src emacs-lisp
(use-package! evil-escape
  :hook (evil-mode . evil-escape-mode)
  :custom
  (evil-escape-key-sequence "jk")
  (evil-escape-delay 0.2)
  (evil-escape-excluded-modes '(dired-mode)))
#+end_src

** Visual feedback for yank/change operations

#+begin_src emacs-lisp
(use-package! evil-goggles
  :hook (evil-mode . evil-goggles-mode)
  :custom (evil-goggles-duration 0.1))
#+end_src

** Move by visual lines, not logical lines

#+begin_src emacs-lisp
(map! :map evil-normal-state-map
      "j" #'evil-next-visual-line
      "k" #'evil-previous-visual-line)
#+end_src

* Completion
** Vertico
#+begin_src emacs-lisp
(after! vertico
  (setq vertico-count 10
        vertico-cycle t))
#+end_src

** Consult
#+begin_src emacs-lisp
(after! consult
  ;; Use fd and rg for faster searching, from vanilla config
  (setq consult-find-args "fd --hidden --strip-cwd --type f --color=never"
        consult-ripgrep-args "rg --null --line-buffered --color=never --smart-case --no-heading --line-number --hidden --glob '!.git/'"))
#+end_src

** Consult-Yasnippet
#+begin_src emacs-lisp
(use-package! consult-yasnippet
  :after (consult yasnippet)
  :config
  (setq consult-yasnippet-category-icon-alist
        '((t . "»")
          ("Emacs Lisp" . "λ")
          ("Text" . "¶")
          ("Org" . "★")
          ("Python" . "🐍"))))

(map! :leader
      :desc "Search snippets" "s y" #'consult-yasnippet)
#+end_src

* File Management
** Dired
#+begin_src emacs-lisp
(after! dired
  ;; Omit files like in the vanilla config
  (setq dired-omit-files "^\\.[^.]\\|^#\\|^\\.$\\|^\\.\\.$\\|\\.pyc$\\|\\.o$")
  (setq dired-listing-switches "-agho --group-directories-first"))
#+end_src

** Dirvish

#+begin_src emacs-lisp
(after! dirvish
  ;; Set quick access directories from vanilla config
  (setq dirvish-quick-access-entries
        '(("h" "~/" "Home")
          ("d" "~/Downloads/" "Downloads")
          ("D" "~/Documents/" "Documents")
          ("p" "~/Projects/" "Projects")
          ("/" "/" "Root")))
  (setq dirvish-attributes '(nerd-icons file-time file-size collapse subtree-state vc-state)))
#+end_src

* Org Mode
** Fonts Setup
#+begin_src emacs-lisp
(defun ar/org-font-setup ()
  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "JetBrainsMono Nerd Font" :weight 'bold :height (cdr face) :slant 'unspecified))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-tag nil :foreground nil :inherit '(shadow fixed-pitch) :weight 'bold)
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
#+end_src

** Core
#+begin_src emacs-lisp
(setq org-directory "~/org"
      org-ellipsis " "
      org-startup-with-inline-images t
      org-image-actual-width 600
      org-archive-location "archive/Archive_%s::"
      org-auto-align-tags nil) ; org-modern handles this better

(defun ar/org-setup-hook ()
  "Modes to enable on org-mode start"
  (org-indent-mode)
  (visual-line-mode)
  (+org-pretty-mode)
  (ar/org-font-setup))

(add-hook! org-mode #'ar/org-setup-hook)
#+end_src

** TODO Reverse TAB behavior
TAB was changed to toggle only the visibility state of the current subtree, rather than cycle through it recursively. This can be reversed with:
#+begin_src emacs-lisp
;; (after! evil-org
;;   (remove-hook 'org-tab-first-hook #'+org-cycle-only-current-subtree-h))
#+end_src

** Org Structure Templates
#+begin_src emacs-lisp
(use-package! org-tempo
  :after org
  :config
  (setq org-src-window-setup 'split-window-below
        org-src-fontify-natively t
        org-src-tab-acts-natively t)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp")))
#+end_src

** Visual Fill Column
To center org text
#+begin_src emacs-lisp
(use-package! visual-fill-column
  :hook (org-mode . visual-fill-column-mode)
  :custom
  (visual-fill-column-width 100)
  (visual-fill-column-center-text t))
#+end_src

** Prettier pop-up for capture templates
#+begin_src emacs-lisp
(setf (alist-get 'height +org-capture-frame-parameters) 15)
#+end_src

** Org TODO Keywords

#+begin_src emacs-lisp
(after! org
  (setq org-todo-keywords
        '((sequence "☛ TODO(t)" "⚡ NEXT(n)" "🔄 PROG(p)" "⏳ WAIT(w@/!)" "|" "✅ DONE(d!)" "❌ CANCELLED(c@)")
          (sequence "🎯 GOAL(G)" "🚀 ACTIVE(A)" "⏸ PAUSED(x)" "|" "🏆 ACHIEVED(a)" "🚫 DROPPED(X)")))
  (setq org-todo-keyword-faces
        '(("☛ TODO" . (:foreground "#f38ba8" :weight bold))
          ("⚡ NEXT" . (:foreground "#fab387" :weight bold))
          ("🔄 PROG" . (:foreground "#89b4fa" :weight bold))
          ("⏳ WAIT" . (:foreground "#f9e2af" :weight bold))
          ("✅ DONE" . (:foreground "#a6e3a1" :weight bold))
          ("❌ CANCELLED" . (:foreground "#cdd6f4" :weight bold))
          ("🎯 GOAL" . (:foreground "#b4befe" :weight bold))
          ("🚀 ACTIVE" . (:foreground "#74c7ce" :weight bold))
          ("⏸ PAUSED" . (:foreground "#9399b2" :weight bold))
          ("🏆 ACHIEVED" . (:foreground "#a6e3a1" :weight bold))
          ("🚫 DROPPED" . (:foreground "#585b70" :weight bold)))))
#+end_src

